# **Описание решения программы.**
------------------------------
**Задача:** Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых
меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте
выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись
исключительно массивами.

-----------------
## **Решение.**
- Вызываем метод *Console.Write("Входной размер массива: ");* который вызывает в терминале строку "Входной размер массива: ".
- Инициализируем переменную *int size* через терминал вызвав метод *Convert.ToInt32(Console.ReadLine())*.
- Создаем метод *string[] CreateArray(int size)* который создает одномерный массив строк. На вход принимает переменную *int size* определяющая длину массива при создании. Внутри метода *CreateArray* инициализируем одномерный массив *string[] newArray* с помощью команды *new string[]*, в квадратных скобках пишем переменную *size*, которая определяет длину одномерного массива. Дальше внутри метода *CreateArray*, вызываем метод *Console.WriteLine()* в скобках метода пишем "Создание массива здесь: " что бы вывести его в терминал. Дальше в методе *CreateArray* создаем цикл *for()*, в скобках пишем условие выполнения цикла *(int i = 0; i < size; i++)*, где переменная *size* будет отвечать за количество отработанных циклов, а переменная *i* будет указывать индекс массива. Внутри цикла вызываем метод *Console.Write()* в скобках которого пишем *($"Ввод {i + 1} строки: ")* где *{i + 1}* указывает номер ячейки массива. Дальше внутри цикла вызываем массив *newArray[]* в квадратных скобках пишем переменную *i* которая указывает на индекс ячейки и инициализируем эту ячейку через терминал, с помощью метода *Convert.ToString(Console.ReadLine())*. Дальше выходим из цикла и внутри метода *CreateArray* пишем команду *return* которая возвращает массив *newArray*.
- Создаем войд метод *ShowArray*, который выводит массив в терминал, на вход принимает одномерный массив типа *string* с называние *array*. Внутри метода *ShowArray* вызываем цикл *for()* в скобках цикла пишем условие *(int i = 0; i< array.Length; i++)* где *i* указывает на индекс массива, а *array.Length* определяет длину массива и отвечает за количество отработанных циклов. Внутри цикла вызываем метод Console.Write(), в скобках которого пишем *(array[i] + " ")* выводим индекс массива в терминал.
- Создаем новый метод типа *string* с названием *CreatesArrayOfThreeCharacters* который будет из имеющегося массива строк формирует массив из строк, длина которых
меньше либо равна 3 символа, на вход принимает массив типа *string* даем название *arrayString*. Внутри метода *CreatesArrayOfThreeCharacters* инициализируем переменную int size = 0, в следующей строке инициализируем новый массив типа *string* c помощью команды *new string[]* в квадратные скобки пишем переменную *size* которая определяет длину нового массива. В следующей строке вызываем цикл *for()* в скобках пишем условие *(int i = 0; i< arrayString.Length; i++)*, где переменная *i* будет указывать на индекс в массиве, а *arrayString.Length* определяет длину массива и отвечает за количество отработанных циклов. Внутри цикла вызываем проверку *if()* с условием *(arrayString[i].Length < 3 || arrayString[i].Length == 3)* который проверяет является ли строка конкретного индекса меньше или равна 3. Если указанное условие выполняется, то внутри тела команды *if()* вызываем метод *Array.Resize(ref newArray, size + 1);* который увеличивает массив *newArray* на значение переменной *size + 1*. в следующей строке инициализируем массив newArray[] по индексу в квадратных скобках с помощью переменной *size*, данными из массива arrayString[] по индексу в квадратных скобках с помощью переменной *i*. В следующей строке пишем инкремент *size++*. Дальше внутри тела метода *CreatesArrayOfThreeCharacters* вызываем новую проверку *if()* с условием *(newArray.Length == 0)* внутри тела *if()* вызываем метод Array.Resize(ref newArray, 1), который назначает длину массива *newArray* в 1 индекс. В следующей строчке в теле *if()* инициализируем первый индекс массива *newArray* строкой "Все строки больше 3 символов" и выходим из тела *if()*. В последней строчке тела метода *CreatesArrayOfThreeCharacters* вызываем команду *return* которая возвращает одномерный массив *newArray*.
- За пределами метода после строчки *int size = Convert.ToInt32(Console.ReadLine());* инициализируем одномерный массив типа *string* с названием *strihgArray* методом *CreateArray()* в скобках метода указываем переменную *size*.
- В следующей строке вызываем метод *ShowArray()* в скобках которого вызываем метод *CreatesArrayOfThreeCharacters()* в скобках на вход указываем одномерный массив *strihgArray*

 





